# #1
# def calculate_z(x, y):
#     return x^2 * y^2 + 3 * x * y^2 - 5 * x^2 * y + x^2 - 2 * y^2 + 4 * x * y - x + y
#
# x_values = [2, -2]
# y_values = [4, -3]
# for x in x_values:
#     for y in y_values:
#         z = calculate_z(x, y)
# print(f"x = {x}, y = {y}, z = {z}")
#
#
# #2
# try:
#     for a in (1, 2, -2, 3, 4):
#         b = a + 2
#         c = (a + 3) / (a + 2)
#         d = (a + 4) / (a + 3)
#         e = (a + 5) / (a + 4)
#
#         print(f' a={a}, b={b}, c={c}, d={d}, e={e}')
# except ZeroDivisionError:
#     print("Ошибка деления на 0")
#
# #3
# for x in [0, 1, 2, -2, 4]:
#     z = (x + 2) * (((x + 2) ** 2 + 3) / ((x + 2) ** 4 + (x + 2) ** 2 + 3))
#     print(x, z)
#
#
#4
import cmath
a = int(input('Введите число a: '))

b = cmath.sin(a)
c = cmath.log(a)

d = cmath.exp(a)
e = abs(a)
s = (a + b) * (a + b + c) * (a + b + c + d) * (a + b + c + d + e)
print( a, b, c, d, e, s)

# вывод
# a = 8
# Введите число a: 8
# 8 (0.9893582466233818-0j) (2.0794415416798357+0j) (2980.9579870417283+0j) 8 (893140596.867473+0j)

# a = -2
# Введите число a: -2
# -2 (-0.9092974268256817-0j) (0.6931471805599453+3.141592653589793j) (0.1353352832366127+0j) 2 (-124.61768516454063+44.8852055402884j)

# a = 4
# Введите число a: 4
# 4 (-0.7568024953079282-0j) (1.3862943611198906+0j) (54.598150033144236+0j) 4 (56226.12443240638+0j)

# a = -5
# -5 (0.9589242746631385+0j) (1.6094379124341003+3.141592653589793j) (0.006737946999085467+0j) 5 (-152.35222354455084+209.2102254800688j)






# 12
#Для решения данного примера необходимо сначала определить функцию,
# которая будет вычислять значение Y для заданного значения X.
# Затем в цикле перебрать заданные значения X и вывести результаты вычислений.

# import math
# def calculate_y(a, b, x):
#     return (a / b) ** x + (a / b) ** (2 * x) + 2 * (a / b) ** (-2 / 3) * math.log2(a / b)
#
# a = 4
# b = 3
# x_values = [2.5, 5, 7, 10]
#
# for x in x_values:
#     y = calculate_y(a, b, x)
#     print(f"X = {x}, Y = {y}")
#Этот код выводит следующий результат:

# X = 2.5, Y = 8.9258161859
# X = 5, Y = 15.487216744
# X = 7, Y = 22.048617302
